# 02 - Load & Save data
- Import Pandas
- Create a simple DataFrame
- Load JSON data
- Load CSV data
- Write to CSV
- Convert data to JSON

## Import Pandas

In [1]:
import pandas as pd

## Create simple DataFrame

In [2]:
df = pd.DataFrame({"firstName": ["Vimal", "Krishiv"], "lastName": ["Menon", "Menon"], "age":[38,1]})
df

  firstName lastName  age
0     Vimal    Menon   38
1   Krishiv    Menon    1

## Load JSON data

In [3]:
dict_data = [
    {
        "firstName": "Vimal",
        "lastName": "Menon",
        "age": 38
    },
    {
        "firstName": "Krishiv",
        "lastName": "Menon",
        "age": 1
    }
]
df = pd.json_normalize(dict_data)
df

  firstName lastName  age
0     Vimal    Menon   38
1   Krishiv    Menon    1

## Load CSV data

In [4]:
pd.read_csv("data.csv")

  firstName lastName  age
0     Vimal    Menon   38
1   Krishiv    Menon    1
2     Nitya    Kurup   33

## Write to CSV

In [5]:
df.to_csv("new.data.csv")

## Convert data to JSON

In [7]:
df.to_json(orient ='records')

'[{"firstName":"Vimal","lastName":"Menon","age":38},{"firstName":"Krishiv","lastName":"Menon","age":1}]'